In [1]:
#1. Create a pandas DataFrame from the following dictionary and display it: data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'London']} df = 
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['NewYork', 'Paris', 'London']}

df = pd.DataFrame(data)

In [2]:
print(df)

      Name  Age     City
0    Alice   25  NewYork
1      Bob   30    Paris
2  Charlie   35   London

In [14]:
#2. Load a CSV file named data.csv into a DataFrame.df = ?
df = pd.read_csv(r'C:\Users\SHRI\Downloads\student_data.csv')
df.head()

        Name Roll_No  Age  Gender  Score Fail/Pass
0  Student_1    R001   20  Female     66      Fail
1  Student_2    R002   24   Other     95      Fail
2  Student_3    R003   25    Male     91      Pass
3  Student_4    R004   25  Female     77      Pass
4  Student_5    R005   24  Female     41      Fail

In [15]:
# 3. Display the first 10 rows of a DataFrame.result = ?

result = df.head(10)
print(result)
result=pd.DataFrame(result)

         Name Roll_No  Age  Gender  Score Fail/Pass
0   Student_1    R001   20  Female     66      Fail
1   Student_2    R002   24   Other     95      Fail
2   Student_3    R003   25    Male     91      Pass
3   Student_4    R004   25  Female     77      Pass
4   Student_5    R005   24  Female     41      Fail
5   Student_6    R006   25   Other     86      Fail
6   Student_7    R007   19   Other      0      Pass
7   Student_8    R008   21  Female      7      Fail
8   Student_9    R009   21    Male     45      Pass
9  Student_10    R010   24  Female     51      Fail

In [21]:

#4 Select only the Name and Age columns from the DataFrame.
 #result = ?

dict = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'London']}
df = pd.DataFrame(dict)

selected_columns = df[['Name', 'Age']]   ## Selects specific columns in dataframe
print(selected_columns)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [22]:
#5 Find the shape (number of rows and columns) of the DataFrame.
#result = ?
df = pd.read_csv(r'C:\Users\SHRI\Downloads\student_data.csv')
df.shape

(50, 6)

In [24]:
#6 Check if there are any missing values in the DataFrame.
# result = ?

df = pd.read_csv(r'C:\Users\SHRI\Downloads\student_data.csv')
df.isnull().sum()

Name         0
Roll_No      0
Age          0
Gender       0
Score        0
Fail/Pass    0
dtype: int64

In [25]:
#7. Add a new column Country to the DataFrame with a default value of 'USA'.
 #df['Country'] = ?
dict = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'London']}
df = pd.DataFrame(dict)

df['Country'] = 'USA'       
df

      Name  Age      City Country
0    Alice   25  New York     USA
1      Bob   30     Paris     USA
2  Charlie   35    London     USA

In [26]:
#8. Delete the City column from the DataFrame.
# df = ?
dict = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'London']}
df = pd.DataFrame(dict)

del df['City']      

df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [23]:
#13. Sort the DataFrame by the Age column in descending order.sorted_df = ?

sorted_result = result.sort_values(by='Age', ascending=False)
print(sorted_result)

         Name Roll_No  Age  Gender  Score Fail/Pass Age_Group date_of_join
5   Student_6    R006   40   Other     86      Fail       Old   2023-11-06
2   Student_3    R003   35    Male     91      Pass       Old   2023-11-03
9  Student_10    R010   34  Female     51      Fail       Old   2023-11-10
7   Student_8    R008   34  Female      7      Fail       Old   2023-11-08
4   Student_5    R005   34  Female     41      Fail       Old   2023-11-05
1   Student_2    R002   30   Other     95      Fail     Young   2023-11-02
3   Student_4    R004   28  Female     77      Pass     Young   2023-11-04
6   Student_7    R007   26   Other      0      Pass     Young   2023-11-07
0   Student_1    R001   25  Female     66      Fail     Young   2023-11-01
8   Student_9    R009   25    Male     45      Pass     Young   2023-11-09

In [27]:
#15. Find the unique values in the City column.
# unique_cities = ?
dict = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'Paris']}
df = pd.DataFrame(dict)

df['City'].unique()

array(['New York', 'Paris'], dtype=object)

In [28]:
#16. Count the occurrences of each unique value in the City column.
# city_counts = ?

dict = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Paris', 'Paris']}
df = pd.DataFrame(dict)

city_counts = df['City'].value_counts()         
city_counts

City
Paris       2
New York    1
Name: count, dtype: int64

In [30]:
#18. Merge two DataFrames df1 and df2 on a common column, ID.
# result = ?
import pandas as pd

df1 = pd.DataFrame({'ID': [1, 2, 3],'Name': ['Manisha', 'Meena', 'Meera']})
df2 = pd.DataFrame({'ID': [2, 3, 4],'Score': [90, 91, 92]})

merge = pd.merge(df1, df2, on='ID')             
merge

   ID   Name  Score
0   2  Meena     90
1   3  Meera     91

In [32]:
#20. Drop all rows with missing values in the DataFrame.
#cleaned_df = ?
import pandas as pd
import numpy as np

df = pd.DataFrame({'Name':['Manisha','Meena',np.nan], 'Age':[23,34,np.nan],'ID':[1, np.nan, 9]})

df = df.dropna()        ## Drops data containg null values
df

      Name   Age   ID
0  Manisha  23.0  1.0

In [33]:
#21. Convert a column date with string values like "2023-01-01" into pandas datetime objects.
# df['date'] = ?
import pandas as pd

# Example DataFrame with date as string
data = {'date': ['2023-01-01', '2023-02-01', '2023-03-01']}
df = pd.DataFrame(data)

# Convert the 'date' column to pandas datetime objects
df['date'] = pd.to_datetime(df['date'])

print(df)

        date
0 2023-01-01
1 2023-02-01
2 2023-03-01

In [34]:
#22. Extract the year, month, and day from the date column and add them as new columns.
 #df['year'] = ?
 #df['month'] = ?
 #df['day'] = ?
date_range=pd.date_range('11/05/1989',periods=8)        
dates=pd.DataFrame(date_range,columns=['Date'])

dates['year']=dates['Date'].dt.year                      
dates['month']=dates['Date'].dt.month
dates['day']=dates['Date'].dt.day

dates

        Date  year  month  day
0 1989-11-05  1989     11    5
1 1989-11-06  1989     11    6
2 1989-11-07  1989     11    7
3 1989-11-08  1989     11    8
4 1989-11-09  1989     11    9
5 1989-11-10  1989     11   10
6 1989-11-11  1989     11   11
7 1989-11-12  1989     11   12

In [35]:
#24. Calculate the time difference in days between two columns, start_date and end_date.
# df['days_difference'] = ?

import pandas as pd

# Create a DataFrame
data = {'start_date': ['2024-01-01', '2024-05-01', '2024-11-15'],
        'end_date': ['2024-01-10', '2024-05-15', '2024-11-25']}

df = pd.DataFrame(data)
df['start_date'] = pd.to_datetime(df['start_date'])
df['end_date'] = pd.to_datetime(df['end_date'])

# Calculate the time difference in days
df['days_difference'] = (df['end_date'] - df['start_date']).dt.days

print(df)

  start_date   end_date  days_difference
0 2024-01-01 2024-01-10                9
1 2024-05-01 2024-05-15               14
2 2024-11-15 2024-11-25               10

In [36]:
#25. Group data by the year from the date column and calculate the total sales for each year.
# grouped = ?

import pandas as pd

# Example DataFrame
data = {'date': ['2021-05-01', '2022-03-15', '2022-07-20', '2023-01-10'],
        'sales': [100, 200, 150, 250]}

df = pd.DataFrame(data)
df['date'] = pd.to_datetime(df['date'])

# Extract the year from the date column
df['year'] = df['date'].dt.year

# Group by the year and calculate the total sales for each year
grouped = df.groupby('year')['sales'].sum().reset_index()

print(grouped)

   year  sales
0  2021    100
1  2022    350
2  2023    250

In [37]:
#26. Group the DataFrame by category and calculate the mean of the sales column.
 #grouped = ?

data = {'date': ['2021-05-01', '2022-03-15', '2022-07-20', '2023-01-10'],
        'sales': [100, 200, 150, 250]}

df['sales'].mean()

np.float64(175.0)

In [38]:
#27. Use multiple columns (region, category) to group the data and find the sum of the sales column.
# grouped = ?
import pandas as pd

# Create a DataFrame
data = {'region': ['Russia', 'India', 'Russia', 'India', 'Russia'],'category': ['A', 'B', 'A', 'B', 'A'],
        'sales': [100, 200, 150, 250, 300]}

df = pd.DataFrame(data)

# Group by 'region' and 'category' and calculate the sum of sales
grouped = df.groupby(['region', 'category'])['sales'].sum()

print(grouped)

region  category
India   B           450
Russia  A           550
Name: sales, dtype: int64

In [39]:
#28. After grouping by region, filter groups where the total sales are greater than 5000.
# filtered_groups = ?

import pandas as pd

# Create a DataFrame
data = {'region': ['North', 'South', 'East', 'West'],'sales': [1000, 2000, 9500, 8000]}

df = pd.DataFrame(data)

# Group by 'region' and calculate the total sales
grouped = df.groupby('region')['sales'].sum()

# Filter groups where total sales are greater than 5000
filtered_groups = grouped[grouped > 5000]

print(filtered_groups)

region
East    9500
West    8000
Name: sales, dtype: int64

In [42]:
#32
import pandas as pd

df = pd.DataFrame({'name': ['Meena', 'Meera', 'Meesha'],'age': [21, 22, 23]})

# Select all rows and 2 columns
subset = df.iloc[:2]

print(subset)

    name  age
0  Meena   21
1  Meera   22

In [43]:
#34
import pandas as pd

df = pd.DataFrame({'name': ['Meena', 'Meera', 'Meesha'],'age': [21, 22, 23]})

reversed_df = df.iloc[::-1].reset_index(drop=True)

print(reversed_df)

     name  age
0  Meesha   23
1   Meera   22
2   Meena   21

In [46]:
#9. Rename the column Age to Years.df = ?
#ans
result = result.rename(columns={'Age': 'Years'})
result

         Name Roll_No  Years  Gender  Score Fail/Pass Age_Group date_of_join
0   Student_1    R001     25  Female     66      Fail     Young   2023-11-01
1   Student_2    R002     30   Other     95      Fail     Young   2023-11-02
2   Student_3    R003     35    Male     91      Pass       Old   2023-11-03
3   Student_4    R004     28  Female     77      Pass     Young   2023-11-04
4   Student_5    R005     34  Female     41      Fail       Old   2023-11-05
5   Student_6    R006     40   Other     86      Fail       Old   2023-11-06
6   Student_7    R007     26   Other      0      Pass     Young   2023-11-07
7   Student_8    R008     34  Female      7      Fail       Old   2023-11-08
8   Student_9    R009     25    Male     45      Pass     Young   2023-11-09
9  Student_10    R010     34  Female     51      Fail       Old   2023-11-10